latex/HigherOrderComputability/HigherOrderComputability.tex
% Created 2022-04-04 Mon 12:56
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\graphicspath{{../../books/}}
\input{../preamble.tex}
\newcommand{\ssmile}[1]{\mathord{\stackrel{\smallsmile}{#1}}}
\DeclareMathOperator{\lv}{lv}
\newcommand{\FF}{f\mspace{-7mu}f}
\newcommand{\TT}{t\mspace{-3mu}t}
\newcommand{\IF}{i\mspace{-4mu}f}
\DeclareMathOperator{\Asm}{\mathcal{A}sm}
\DeclareMathOperator{\nMod}{\mathcal{M}od}
\DeclareMathOperator{\PC}{\textsf{PC}}
\DeclareMathOperator{\PCF}{PCF}
\DeclareMathOperator{\eff}{eff}
\DeclareMathOperator{\tT}{T}
\makeindex
\author{John Longley \& Dag Normann}
\date{\today}
\title{Higher Order Computability}
\hypersetup{
 pdfauthor={John Longley \& Dag Normann},
 pdftitle={Higher Order Computability},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.92 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Theory of Computability Models}
\label{sec:org772aa94}
