books/HigherOrderComputability.org
*** Type worlds
    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    1. A *type world* is simply a set \(\sfT\) of *type names* \sigma, optionally endowed with any or
       all of the following:
       1. a *fixing map*, assigning a set \(\sfT[\sigma]\) to certain type names \(\sigma\in\sfT\)
       2. a *product structure*, consisting of a total binary operation \((\sigma,\tau)\mapsto\sigma\times\tau\)
       3. an *arrow structure*, consisting of a total binary operation \((\sigma,\tau)\mapsto\sigma\to\tau\)
    2. A *computability model over* a type world \(\sfT\) is a computability model \(\bC\) with index
       set \(\sfT\) (so that \(\abs{\bC}=\{\bC(\sigma)\mid\sigma\in\sfT\}\)) subject to the following conventions
       1. If \(\sfT\) has a fixing map, then \(\bC(\sigma)=T[\sigma]\) whenever \(\sfT(\sigma)\) is defined
       2. If \(\sfT\) has a product structure, then \(\bC\) has weak products and for any \(\sigma,\tau\in\sfT\)
          we have \(\bC(\sigma\times\tau)=\bC(\sigma)\bowtie\bC(\tau)\)
       3. If \(\sfT\) has an arrow structure, then \(\bC\) is a higher-order model and for
          any \(\sigma,\tau\in\sfT\) we have \(\bC(\sigma\to\tau)=\bC(\sigma)\Rightarrow\bC(\tau)\)
       4. If \(\sfT\) has both a product and an arrow structure, then \(\bC\) is weakly cartesian closed
    #+END_definition

    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    The one-element type world \(\sfO=\{*\}\) with just the arrow structure \(*\to*=*\). TPCAs over this
    type world are precisely (untyped) PCAs; both \(K_1\) and \(\Lambda/\sim\) are examples
    #+END_examplle

    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    If \(\beta_0,\dots,\beta_{n-1}\) are distinct *basic type names* and \(B_0,\dots,B_{n-1}\) are sets, we may define
    the type word \(\sfT^{\to}(\beta_0=B_0,\dots,\beta_{n-1}=B_{n-1})\) to consist of formal type expressions
    freely constructed from \(\beta_0,\dots,\beta_{n-1}\) via \(\to\), fixing the interpretation of each \(\beta_i\)
    at \(B_i\). This type world has a fixing map and an arrow structure, but no product. We may write
    just \(\sfT^{\to}(\beta_0,\dots,\beta_{n-1})\) if we do not wish to constrain the interpretation of the \(\beta_i\)

    A typical example is the type world \(\sfT^\to(\ttN=\N)\). Models over this type would correspond
    to *finite type structures* over \(\N\); the models \(\sfK(B;C)\) are examples

    Type world \(\sfT^{\to}(\ttN=\N_\bot)\) where \(\N_\bot\) is the set of natural numbers together with an
    additional element \(\bot\) representing 'non-termination'. Whereas \(\N\) may be used to model
    actual *results* of computation, we may think of \(\N_\bot\) as representing some computational
    *process* which may or may not return a natural number.
    #+END_examplle

    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    Similarly, we define \(\sfT^{\to\times}=(\beta_0=B_0,\dots,\beta_{n-1}=B_{n-1})\) to be the type world consisting
    of type expressions freely constructed form \(\beta_0,\dots,\beta_{n-1}\) via \(\to\) and \(\times\), fixing the
    interpretation of each \(\beta_i\) at \(B_i\). If no fixing map is required, we write
    just \(\sfT^{\to\times}(\beta_0,\dots,\beta_{n-1})\)

    Type worlds featuring a *unit type* (denoted by \(\texttt{1}\)) are also useful. We shall
    write \(\sfT^{\to\times\texttt{1}}(\beta_0=B_0,\dots,\beta_{n-1}=B_{n-1})\) for the type world
    \begin{equation*}
    \sfT^{\to\times}(\texttt{1}=\{()\},\beta_0=B_0,\dots,\beta_{n-1}=B_{n-1})
    \end{equation*}
    We will often refer to the type names in a type world simply as *types*, and use \rho, \sigma, \tau to range
    over them. When dealing with formal type expressions, we adopt the usual convention that \(\to\)
    is right-associative, so that \(\rho\to\sigma\to\tau\) means \(\rho\to(\sigma\to\tau)\). For definiteness, we may also declare
    that \(\times\) is right-associative, although in practice we shall not always bother to distinguish
    between \((\rho\times\sigma)\times\tau\) and \(\rho\times(\sigma\times\tau)\). We consider \(\times\) as binding more tightly than \(\to\)

    We shall use the notation \(\sigma_0,\dots,\sigma_{r-1}\to\tau\) as an abbreviation for \(\sigma_0\to\sigma_1\to\dots\to\sigma_{r-1}\to\tau\)
    (allowing this to mean \tau in the sense \(r=0\)). This allows us to express our intention
    regarding which objects are to be thought of as 'arguments' to a given operation: for instance,
    the types \(\ttN,\ttN,\ttN\to\ttN\) and \(\ttN,\ttN\to(\ttN\to\ttN)\) are formally the same, but in
    the first case we are thinking of a three-argument operation returning a natural number, while
    in the second we are thinking of a two-argument operation returning a function \(\N\to\N\). We also
    write \(\sigma^{(r)}\to\tau\) for the type \(\sigma,\dots,\sigma\to\tau\) with \(r\) arguments. The notation \(\sigma^r\) is
    reserved for the \(r\)-fold product type \(\sigma\times\dots\times\sigma\)
    #+END_examplle

    #+ATTR_LATEX: :options []
    #+BEGIN_proposition
    Any type \(\sigma\in\sfT^{\to}(\beta_0,\dots,\beta_{n-1})\) may be uniquely written in the form \(\sigma_0,\dots,\sigma_{r-1}\to\beta_i\)
    #+END_proposition

    We shall call this the *argument form* of \sigma. The importance of this is that it provides a useful
    induction principle for types: if a property holds for \(\sigma_0,\dots,\sigma_{r-1}\to\beta_i\) whenever it holds
    for each of \(\sigma_0,\dots,\sigma_{r-1}\), then it holds for all \(\sigma\in\sfT^{\to}(\beta_0,\dots,\beta_{n-1})\). We shall
    refer to this as *argument induction*; it is often preferable as an alternative to the usual
    *structural induction* on types

    Closely associated with argument form is the notion of the *level* of a type \sigma: informally, the
    stage at which \sigma appears in the generation of \(\sfT^\to(\beta_0,\dots,\beta_{n-1})\) via argument induction:
    \begin{align*}
    \lv(\beta_i)&=0\\
    \lv(\sigma_0,\dots,\sigma_{r-1}\to\beta_i)&=1+\max_{i<r}\lv(\sigma_i)\quad(r\ge 1)
    \end{align*}
    When working with \(\sfT^{\to\times}(\beta_0,\dots,\beta_{n-1})\), it is natural to augment this definition with
    \begin{equation*}
    \lv(\sigma\times\tau)=\max(\lv(\sigma),\lv(\tau))
    \end{equation*}
    We may define the *pure type of level \(k\) over \sigma*, written \(\bark[\sigma]\):
    \begin{equation*}
    \bbar{0}[\sigma]=\sigma,\quad\ove{k+1}[\sigma]=\bark[\sigma]\to\sigma
    \end{equation*}
    For type worlds generated by a single base type \beta, we may write simply \(\bark\)
    for \(\bark[\beta]\). For instance, in the type word \(\sfT^{\to}(\N)\) we write \(\bbar{2}\) for the
    type \((\ttN\to\ttN)\to\ttN\).
**  Further Examples of Higher-Order Models
*** Kleene's Second Model
    Whereas \(K_1\) captures a notion of computability for finitary data such as numbers, our next
    example embodies a notion of computability in an /infinitary/ setting.

    When our computation returns a result \(F(g)\in\N\), it must do so after only a finite number of
    'computation steps'

    If \(F:\N^{\N}\to\N\) is computable, the function \(F\) can be completely described by recording, for
    each finite sequence \(m_0,\dots,m_{r-1}\), whether the information '\(g(0)=m_0,\dots,g(r-1)=m-1\)'
    suffices to determine the value of \(F(g)\), and if so, what the value is. We write \(\la\cdots\ra\)for
    standard computable operation \(\N^*\to\N\)
    \begin{align*}
    &f(\la m_0,\dots,m_{r-1}\ra)=m-1&&\text{if }F(g)=m\text{ whenever }g(0)=m_0,\dots,g(r-1)=m_{r-1}\\
    &f(\la m_0,\dots,m_{r-1}\ra)=0&&\text{'}g(0)=m_0,\dots,g(r-1)=m_{r-1}\text{' does not}\\
    &&&\text{suffice to determine }F(g)
    \end{align*}
    We can then compute \(F(g)\) from just \(f\) and \(g\)
    \begin{align*}
    F(g)=(f\mid g):=&f(\la g(0),\dots,g(r-1)\ra)-1\\
    &\text{where }r=\mu r.f(\la g(0),\dots,g(r-1)\ra)>0
    \end{align*}
    Even if \(f\in\N^{\N}\) does not represent some \(F\) in this way, we can regard the above formula
    as defining a /partial/ computable function \((f\mid-):\N^{\N}\rhu\N\)

    A small tweak is to obtain an application operation with codomain \(\N^{\N}\) rather than \(\N\).
    In effect, the computaion now accepts an additional argument \(n\in N\), which can be assumed to
    be known before any queries to \(g\) are made. We may therefore define
    \begin{align*}
    (f\odot g)(n):=&f(\la n,g(0),\dots,g(r-1)\ra)-1\\
    &\text{where }r=\mu r.f(\la n,g(0),\dots,g(r-1)\ra)>0
    \end{align*}
    In general, this will define a *partial* function \(\N\rhu\N\). We shall henceforth
    consider \(f\odot g\) to be 'defined' only if the above formula yields a /total/ function \(\N\to\N\). In
    this way, we obtain a partial application operation
    \begin{equation*}
    \odot:\N^{\N}\times\N^{\N}\rhu\N^{\N}
    \end{equation*}
    The structure \((\N^{\N},\odot)\) is known to be *Kleene's second model*

    We can also restrict \(\odot\) to the set of total /computable/' functions \(\N\to\N\). Since the natural
    candidates for \(k,s\) in \(K_2\) are computable, this gives us both a PCA \(K_2^{\eff}\) and a
    relative PCA \((K_2;K_2^{\eff})\)
*** COMMENT The Partial Continuous Functionals
    The model \(\PC\) consisting of *partial continuous functionals* over the natural numbers over the
    type world \(\sfT=\sfT^{\to\times 1}(\ttN=\N_\bot)\)

    The idea is that we shall construct sets \(\PC(\sigma)\) for each \(\sigma\in\sfT\), where each \(\PC(\sigma\to\tau)\)
    consists of all functions \(f:\PC(\sigma)\to\PC(\tau)\) that are 'continuous' in the sense that any finite
    piece of observable information about an output \(f(x)\) can only rely on a finite amount of
    information about \(x\). To make sense of this, we need to provide, along with each \(\PC(\sigma)\),
    a reasonable notion of 'finite piece of information' for elements of \(\PC(\sigma)\).

    It is natural to identify a 'piece of information' with the set of elements of which that information is true,
    so in the first instance, we shall specify a family \(\calf_\sigma\) consisting of those subsets
    of \(\PC(\sigma)\) which we regard as _representing finitary properties of elements_. (In
    fact, \(\calf_\sigma\) will form a basis for *Scott topology*)

    We construct these data by induction on types. At base type, we take \(\PC(\ttN)=\N_\bot\)
    and \(\calf_{\ttN}=\{\N_\bot\}\cup\{\{n\}\mid n\in\N\}\);  the idea is that each \(n\) corresponds to a finite piece of
    information, while the whole set \(\N_\bot\) represents 'no information'.We also
    take \(\PC(1)=\{()\}_\bot\) and \(\calf_1=\{\{()\}_\bot,\{()\}\}\). For products we take \(\PC(\sigma\times\tau)=\PC(\sigma)\times\PC(\tau)\)
    and let \(\calf_{\sigma\times\tau}\) consists of all sets \(U\times V\) where \(U\in\calf_\sigma\), \(V\in\calf_\tau\). At function types,
    we take \(\PC(\sigma\to\tau)\) to consist of all functions \(f:\PC(\sigma)\to\PC(\tau)\) that are *continuous* in that
    for all \(x\in\PC(\sigma)\) and all \(V\in\calf_\tau\) containing \(f(x)\), there is some \(U\in\calf_\sigma\)
    containing \(x\)with \(f(U)\subseteq V\)

    The continuity of a function \(f\) may be manifested by its /graph/, namely the set of
    pairs \((U,V)\in\calf_\sigma\times\calf_\tau\) with \(f(U)\subseteq V\). Since each pair \((U,V)\) in the graph of \(f\) can be
    reasonably seen as giving finite information about \(f\), it seems natural to identify finite
    pieces of information with finite subsets of this graph. We therefore decree that \(\calf_{\sigma\to\tau}\)
    should contain all finite intersections of sets of the form
    \begin{equation*}
    (U\Rightarrow V):=\{f\in\PC(\sigma\to\tau)\mid\forall x\in U.f(x)\in V\}
    \end{equation*}
    for \(U\in\calf_\sigma\), \(V\in\calf_\tau\)

    For any \(\sigma,\tau\) we have the application operation \((f,x)\mapsto f(x):\PC(\sigma\to\tau)\times\PC(\sigma)\to\PC(\tau)\)
