latex/HigherOrderComputability/HigherOrderComputability.tex
\subsection{Further Examples of Higher-Order Models}
\label{sec:org1838659}
\subsubsection{Kleene's Second Model}
\label{sec:orgef1c5ca}
Whereas \(K_1\) captures a notion of computability for finitary data such as numbers, our next
example embodies a notion of computability in an \emph{infinitary} setting.

When our computation returns a result \(F(g)\in\N\), it must do so after only a finite number of
'computation steps'

If \(F:\N^{\N}\to\N\) is computable, the function \(F\) can be completely described by recording, for
each finite sequence \(m_0,\dots,m_{r-1}\), whether the information '\(g(0)=m_0,\dots,g(r-1)=m-1\)'
suffices to determine the value of \(F(g)\), and if so, what the value is. We write \(\la\cdots\ra\)for
standard computable operation \(\N^*\to\N\)
\begin{align*}
&f(\la m_0,\dots,m_{r-1}\ra)=m-1&&\text{if }F(g)=m\text{ whenever }g(0)=m_0,\dots,g(r-1)=m_{r-1}\\
&f(\la m_0,\dots,m_{r-1}\ra)=0&&\text{'}g(0)=m_0,\dots,g(r-1)=m_{r-1}\text{' does not}\\
&&&\text{suffice to determine }F(g)
\end{align*}
We can then compute \(F(g)\) from just \(f\) and \(g\)
\begin{align*}
F(g)=(f\mid g):=&f(\la g(0),\dots,g(r-1)\ra)-1\\
&\text{where }r=\mu r.f(\la g(0),\dots,g(r-1)\ra)>0
\end{align*}
Even if \(f\in\N^{\N}\) does not represent some \(F\) in this way, we can regard the above formula
as defining a \emph{partial} computable function \((f\mid-):\N^{\N}\rhu\N\)

A small tweak is to obtain an application operation with codomain \(\N^{\N}\) rather than \(\N\).
In effect, the computaion now accepts an additional argument \(n\in N\), which can be assumed to
be known before any queries to \(g\) are made. We may therefore define
\begin{align*}
(f\odot g)(n):=&f(\la n,g(0),\dots,g(r-1)\ra)-1\\
&\text{where }r=\mu r.f(\la n,g(0),\dots,g(r-1)\ra)>0
\end{align*}
In general, this will define a \textbf{partial} function \(\N\rhu\N\). We shall henceforth
consider \(f\odot g\) to be 'defined' only if the above formula yields a \emph{total} function \(\N\to\N\). In
this way, we obtain a partial application operation
\begin{equation*}
\odot:\N^{\N}\times\N^{\N}\rhu\N^{\N}
\end{equation*}
The structure \((\N^{\N},\odot)\) is known to be \textbf{Kleene's second model}

We can also restrict \(\odot\) to the set of total \emph{computable}' functions \(\N\to\N\). Since the natural
candidates for \(k,s\) in \(K_2\) are computable, this gives us both a PCA \(K_2^{\eff}\) and a
relative PCA \((K_2;K_2^{\eff})\)
