latex/HigherOrderComputability/HigherOrderComputability.tex
\subsubsection{Typed \texorpdfstring{\(\lambda\)}{λ}-Calculi}
\label{sec:org167de23}

We work in the type world \(\sfT=\sfT^{\to}(\beta_0,\dots,\beta_{r-1})\) where \(\beta_i\) are base types. We
assume given some set \(C\) of \textbf{constant symbols} \(c\), each with an assigned type \(\tau_c\in\sfT\);
we also suppose we have an unlimited supply of \textbf{variable symbols} \(x^\sigma\) for each \(\sigma\).

\(\Xi\) specifies \textbf{basic evaluation contexts} \(K[-]\)

\begin{examplle}[]
Let \(C\) consist of the following constants
\begin{align*}
\hat{0}&:\ttN\\
suc&:\ttN\to\ttN\\
rec_\sigma&:\sigma\to(\sigma\to\ttN\to\sigma)\to\ttN\to\sigma
\end{align*}
Let \(\Delta\) consist of the \(\delta\)-rules
\begin{gather*}
rec_\sigma xf\hat{0}\rightsquigarrow x\\
rec_\sigma xf(suc\; n)\rightsquigarrow f(rec_\sigma xfn)n
\end{gather*}
and let \(\Xi\) consist of the contexts of the forms
\begin{equation*}
[-]N,\quad suc[-],\quad rec_\sigma PQ[-]
\end{equation*}
The first means that if \(M\rightsquigarrow M'\) then \(MN\rightsquigarrow MN'\)

This defines Gödel's \textbf{System \(T\)}
\end{examplle}

\begin{examplle}[Plotkin's PCF]
Let \(C\) consists of the following constants
\begin{align*}
\hat{0}&:\ttN\quad\forall n\in\N\\
suc,pre&:\ttN\to\ttN\\
ifzero&:\ttN,\ttN,\ttN\to\ttN\\
Y_\sigma&:(\sigma\to\sigma)\to\sigma\quad\forall\sigma\in\sfT
\end{align*}
Let \(\Delta\) consist of rules of the forms
\begin{align*}
suc\;\hatn&\rightsquigarrow\what{n+1}\\
pre\;\what{n+1}&\rightsquigarrow\hatn\\
pre\;\hat{0}&\rightsquigarrow\hat{0}\\
ifzero\;\hat{0}&\rightsquigarrow\lambda xy.x\\
ifzero\;\what{n+1}&\rightsquigarrow\lambda xy.y\\
Y_\sigma f&\rightsquigarrow f(Y_\sigma f)
\end{align*}
and let \(\Xi\) consist of the contexts of the forms
\begin{equation*}
[-]N,\quad suc[-],\quad pre[-],\quad ifzero[-]
\end{equation*}
The resulting language is known as Plotkin's PCF (\emph{Programming language for Computable Functions})
\end{examplle}

Given \(\Delta\) and \(\Xi\) as above, let us define a \textbf{one-step reduction} relation \(\rightsquigarrow\) between closed terms
of the same type by means of the following inductive definition
\begin{enumerate}
\item \((\lambda x^\sigma.M)N\rightsquigarrow M[x^\sigma\mapsto N]\) (\textbf{\(\beta\)-reduction})
\item If \((cM_0\dots M_{r-1}\rightsquigarrow N)\in\Delta\) and \(-^*\) denotes some type-respecting substitution of closed
terms for the free variables of \(cM_0\dots M_{r-1}\),
then \((cM_0^*\dots M_{r-1}^*)\rightsquigarrow N^*\)
\item If \(M\rightsquigarrow M'\) and \(K[-]\in\Xi\), then \(K[M]\rightsquigarrow K[M']\)
\end{enumerate}


We call the entire system the \textbf{typed \(\lambda\)-calculus} specified by \(\vec{\beta},C,\Delta,\Xi\)

Depending on the choice of \(\Delta\) and \(\Xi\), the relation \(\rightsquigarrow\) may or may not be \textbf{deterministic} in the
sense that \(M\rightsquigarrow M'\wedge M\rightsquigarrow M''\Rightarrow M'=M''\). Note that both System T and PCF have deterministic
reduction relations.

Typically we are interested in the possible values of a closed term \(M\), that is, those
terms \(M'\) s.t. \(M\rightsquigarrow^*M'\) and \(M'\) can be reduced no further. In System T, every
closed \(M:\ttN\) reduces to a unique numeral \(suc^k\hat{0}\). In PCF, there are terms such
as \(Y_{\ttN}(\lambda x^{\ttN}.x)\)  that can never be reduced to a value. Thus System T is in essence
a language for \textbf{total} functions, whilst PCF is a language for \textbf{partial} ones


Let \(=_{op}\) be the \textbf{operational equivalence} relation on closed terms generated by
\begin{equation*}
M\rightsquigarrow M'\Rightarrow M=_{op}M',\quad M=_{op}M'\Rightarrow MN=_{op}M'N\wedge PM=_{op}PM'
\end{equation*}
