books/HigherOrderComputability.org
*** Numerals
    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    A model \(\bA\) has *numerals* if for some type \(\ttN\) there exist
    \begin{align*}
    \hat{0},\hat{1},\hat{2},\dots&\in\bA^\sharp(\ttN)\\
    suc&\in\bA^\sharp(\ttN\to\ttN)
    \end{align*}
    and for any \(x\in\bA^\sharp(\sigma)\) and \(f\in\bA^\sharp(\ttN\to\sigma\to\sigma)\) an element
    \begin{equation*}
    Rec_\sigma(x,f)\in\bA^\sharp(\ttN\to\sigma)
    \end{equation*}
    s.t. for all \(x\in\bA^\sharp(\sigma)\), \(f\in\bA^\sharp(\ttN\to\sigma\to\sigma)\) and \(n\in\N\) we have
    \begin{align*}
    suc\cdot\hatn&=\what{n+1}\\
    Rec_\sigma(x,f)\cdot\hat{0}&=x\\
    Rec_\sigma(x,f)\cdot\what{n+1}&\succeq f\cdot\hatn\cdot(Rec_\sigma(x,f)\cdot\hatn)
    \end{align*}
    #+END_definition

    The above definition has the advantage that it naturally adapts to the setting of a
    computability model C with products: just replace the types of \(f\) and \(Rec_\sigma(x,f)\) above
    with \(\bC[\ttN\times\sigma,\sigma]\) and \(\bC[\ttN,\sigma]\) respectively.

    #+ATTR_LATEX: :options []
    #+BEGIN_proposition
    A model \(\bA\) has numerals iff it has elements \(\hatn\), \(suc\) as above and
    \begin{equation*}
    rec_\sigma\in\bA^\sharp(\sigma\to(\ttN\to\sigma\to\sigma)\to\ttN\to\sigma)\quad\text{for each }\sigma
    \end{equation*}
    s.t. for all \(x\in\bA^\circ(\sigma)\), \(f\in\bA^\circ(\ttN\to\sigma\to\sigma)\) and \(n\in\N\) we have
    \begin{align*}
    suc\cdot\hatn&=\what{n+1}\\
    rec_\sigma\cdot x\cdot f\cdot\hat{0}&=x\\
    rec_\sigma\cdot x\cdot f\cdot\what{n+1}&\succeq f\cdot\hatn\cdot(rec_\sigma\cdot x\cdot f\cdot\hatn)
    \end{align*}
    #+END_proposition

    #+BEGIN_proof
    \(\Leftarrow\): Let \(Rec_\sigma(x,f)=rec_\sigma\cdot x\cdot f\)

    \(\Rightarrow\): define
    \begin{equation*}
    rec_\sigma=Rec_{\sigma\to(\ttN\to\sigma\to\sigma)\to\sigma}(\lambda^*xf.x,\lambda^*nr.\lambda^*xf.fn(rxf))
    \end{equation*}
    ?
    #+END_proof

    #+BEGIN_exercise
    Show that \(\bA\) has numerals, then \(\bA\) has booleans
    #+END_exercise

    #+BEGIN_proof
    \(Rec_\sigma(x,f)=x\), where \(x=\lambda xy.y\)
    #+END_proof

    #+ATTR_LATEX: :options []
    #+BEGIN_proposition
    label:3.3.13
    Every untyped model has numerals
    #+END_proposition

    #+BEGIN_proof
    Using the encodings for pairings and booleans given above, we may define the *Curry
    numerals* \(\hatn\) in any untyped models as follows:
    \begin{equation*}
    \hat{0}=\la\TT,\TT\ra,\quad\what{n+1}=\la\FF,\hatn\ra
    \end{equation*}
    and \(suc=\lambda^*x.\la\FF,x\ra\). We also have elements for the zero testing and predecessor operations:
    take \(iszero=fst\) and \(pre=\lambda^*x.\IF(iszero\;x)\hat{0}(snd\;x)\)
    #+END_proof

    In any model with numerals, a rich class of functions \(\N^r\to\N\) is representable. For example, the
    (first-order) primitive recursive functions on \(\N\)

    #+ATTR_LATEX: :options []
    #+BEGIN_proposition
    label:3.3.14
    For any primitive recursive \(f:\N^r\to\N\) there is an applicative expression \(e_f:\N^{(r)}\to\N\)
    (involving constants 0, \(suc\), \(rec_{\ttN}\)) s.t. in any model \((\bA^\circ;\bA^\sharp)\) with numerals
    we have \(\llb{e_f}_v\in\bA^\sharp\) (where \(v\) is the obvious valuation of the constants) and
    \begin{equation*}
    \forall n_0,\dots,n_{r-1},m. f(n_0,\dots,n_{r-1})=m\Rightarrow\llb{e_f}_v\cdot\hatn_0\cdot\hatn_{r-1}=\hatm
    \end{equation*}
    #+END_proposition

    #+BEGIN_proof

    #+END_proof
*** Recursion and Minimization
    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    1. A total model \(\bA\) *has general recursion*, or *has fixed points*, if for every
       element \(f\in\bA^\sharp(\rho\to\rho)\) there is an element \(Fix_\rho(f)\in\bA^\sharp(\rho)\) s.t. \(Fix_\rho(f)=f\cdot Fix_\rho(f)\)
    2. An arbitrary model \(\bA\) *has guarded recursion*, or *guarded fixed points*, if for every
       element \(f\in\bA^\sharp(\rho\to\rho)\) where \(\rho=\sigma\to\tau\) there is an element \(GFix_\rho(f)\in\bA^\sharp(\rho)\)
       s.t. \(GFix_\rho(f)\cdot x\succeq f\cdot GFix_\rho(f)\cdot x\) for all \(x\in\bA^\circ(\sigma)\)
    #+END_definition

    #+ATTR_LATEX: :options []
    #+BEGIN_proposition
    1. A total model \(\bA\) has general recursion iff for every type \rho there is an
       element \(Y_\rho\in\bA^\sharp((\rho\to\rho)\to\rho)\) s.t. for all \(f\in\bA^\circ(\rho\to\rho)\) we have
       \begin{equation*}
       Y_\rho\cdot f=f\cdot(Y_\rho\cdot f)
       \end{equation*}
    2. \(\bA\) has guarded recursion iff for every type \(\rho=\sigma\to\tau\) there is an
       element \(Z_\rho\in\bA^\sharp((\rho\to\rho)\to\rho)\) s.t. for all \(f\in\bA^\circ(\rho\to\rho)\) and \(x\in\bA^\circ(\sigma)\) we have
       \begin{equation*}
       Z_\rho\cdot f\downarrow,\quad Z_\rho\cdot f\cdot x\succeq f\cdot(Z_\rho\cdot f)\cdot x
       \end{equation*}
    #+END_proposition

    #+BEGIN_proof
    Define
    \begin{equation*}
    Y_\rho=Fix_{(\rho\to\rho)\to\rho}(\lambda^*y.\lambda^*f.f(yf)),\quad Z_\rho=GFix_{(\rho\to\rho)\to\rho}(\lambda^*z.\lambda^*fx.f(zf)x)
    \end{equation*}
    #+END_proof

    Not all models of interest possess such recursion operators. Clearly, if \(\bA\) is a *total* model
    with \(\bA(\ttN)=\N\) a type of numerals as above, then \(\bA\) cannot have general or even guarded
    recursion: if \(\rho=\ttN\to\ttN\)  and \(f=\lambda^*gx.suc(gx)\) then we would
    have \(Z\cdot f\cdot\hatn=suc\cdot Z\cdot f\cdot\hatn\), which is impossible. However, many models
    with \(\bA(\ttN)=\N_\bot\) will have general recursion

    Any *untyped* total model has general recursion, since we may take
    \begin{equation*}
    W=\lambda^*wf.f(wwf),\quad Y=WW
    \end{equation*}
    (This element \(Y\) is known as the *Turing fixed point combinator*). Likewise, every untyped
    model, total or not, has guarded recursion, since we may take
    \begin{equation*}
    V=\lambda^*vfx.f(vvf)x,\quad Z=VV
    \end{equation*}

    Note in passing that Kleene’s *second recursion theorem* from classical computability theory is
    tantamount to the existence of a guarded recursion operator in \(K_1\)

    We can now prove ref:3.3.13. In any untyped model, let \(Z\) be a guarded recursion operator,
    define
    \begin{equation*}
    R=\lambda^*rxfm.\IF(iszero\;m)(kx)(\lambda^*y.f(pre\;m))(rxf(pre\; m)\hat{0})
    \end{equation*}
    and take \(rec=\lambda^*xfm.(ZR)xfmi\).

    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    A model \(\bA\) with numerals *has minimization* if it contains an
    element \(min\in\bA^\sharp((\ttN\to\ttN)\to\ttN)\) s.t. whenever \(\hatg\in\bA^\circ(\ttN\to\ttN)\) represents some
    total \(g:\N\to\N\) and \(m\) is the least number s.t. \(g(m)=0\), we have \(min\cdot\hatg=\hatm\)
    #+END_definition

    #+ATTR_LATEX: :options []
    #+BEGIN_proposition
    label:3.3.19
    There is an applicative expression Min involving constants \(\hat{0}\), suc, iszero, if
    and \(Z\) s.t. in any model with numerals and guarded recursion, \(\llb{Min}_v\) is a
    minimization operator
    #+END_proposition

    #+BEGIN_proof
    Take \(Min=Z(\lambda^*M.\lambda^*g.\IF(iszero(g\;\hat{0}))\hat{0}(M(\lambda^*n.g(suc\;n))))\)
    #+END_proof

    #+ATTR_LATEX: :options []
    #+BEGIN_proposition
    label:3.3.20
    For any partial computable \(f:\N^r\rhu\N\) there is an applicative
    expression \(e_f:\ttN^{(r)}\to\ttN\) (involving constants 0, suc, \(rec_{\ttN}\), min) s.t. in any
    model \(\bA\) with numerals and minimization we have \(\llb{e_f}_v\in\bA^\sharp\) (with the obvious
    valuation \(v\)) and
    \begin{equation*}
    \forall n_0,\dots,n_{r-1},m. f(n_0,\dots,n_{r-1})=m\Rightarrow\llb{e_f}_v\cdot\hatn_0\cdot\dots\cdot\hatn_{r-1}=\hatm
    \end{equation*}
    #+END_proposition

    #+BEGIN_proof
    Since our definition of minimization refers only to total functions \(g:\N\to\N\), we appeal to the
    /Kleene normal form/ theorem: there are primitive recursive functions \(T:\N^{r+2}\to\N\) and \(U:\N\to\N\)
    such that any partial computable \(f\) has an ‘index’ \(e\in\N\) such
    that \(f(\barn)\simeq U(\mu y.T(e,\barn,y)=0)\)
    for all \(\barn\). Using this, the result follows easily from Propositions ref:3.3.14 and ref:3.3.19.
    #+END_proof
*** The Category of Assemblies
    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    Let \(\bC\) be a lax computability model over \(T\). The *category of assemblies over* \(\bC\),
    written \(\Asm(\bC)\) is defined as follows:
    * Objects \(X\) are triples \((\abs{X},\rho_X,\Vdash_X)\) where \(\abs{X}\) is a set, \(\rho_X\in T\)
      names some type, and \(\Vdash_X\subseteq\bC(\rho_X)\times\abs{X}\) is a relation
      s.t. \(\forall x\in\abs{X}.\exists a\in\bC(\rho_X).a\Vdash_Xx\) (The formula \(a\Vdash_Xx\) may be read as '\(a\)
      *realizes* \(x\)')
    * A morphism \(f:X\to Y\) is a function \(f:\abs{X}\to\abs{Y}\) that is *tracked* by
      some \(\barf\in\bC[\rho_X,\rho_Y]\), in the sense that for any \(x\in\abs{X}\) and \(a\in\bC(\rho_X)\) we have
      \begin{equation*}
      a\Vdash_Xx\Rightarrow\barf(a)\Vdash_Yf(x)
      \end{equation*}


    An assembly \(X\) is called *modest* if \(a\Vdash_Xx\wedge a\Vdash_Xx'\) implies \(x=x'\). We
    write \(\nMod(\bC)\) for the full subcategory of \(\Asm(\bC)\) consisting of modest assemblies
    #+END_definition

    Intuitively, we regard an assembly \(X\) as an "abstract datatype" for which we have a concrete
    implementation on the "machine" \(\bC\). The underlying set \(\abs{X}\) is the set of values of
    the abstract type, and for each \(x\in\abs{X}\), the elements \(a\Vdash_Xx\) are the possible
    machine representations of this abstract value. (Note that an abstract value \(x\) may have many
    possible machine representations \(a\).) The morphisms \(f:X\to Y\) may then be regarded as the
    "computable mappings" between such datatypes

    In the case that \(\bC\) is a lax TPCA \(\bA\), we may also denote the above
    categories \(\Asm(\bA)\), \(\nMod(\bA)\), or by \(\Asm(\bA^\circ;\bA^\sharp)\), \(\nMod(\bA^\circ;\bA^\sharp)\). Note that
    realizers for elements \(x\in\abs{X}\) may be arbitrary elements of \(\bA^\circ(\rho_X)\), whereas a
    morphism \(f:X\to Y\) must be tracked by an element of \(\bA^\sharp(\rho_X\to\rho_Y)\)

    Viewed in this way, all the datatypes we shall typically wish to consider in fact live in the
    subcategory \(\nMod(\bC)\): an abstract data value is uniquely determined by any of its machine
    representations. Note also that if \(Y\) is modest, a morphism \(f:X\to Y\) is completely determined by
    any \(\barf\) that tracks it.

    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    Let the category \(\bC\) have binary products. An *exponential* of objects \(B\) and \(C\) consists
    of an object \(C^B\) and an arrow \(\epsilon:C^B\times B\to C\) s.t. for any object \(A\) and
    arrow \(f:A\times B\to C\) there is a unique arrow \(\tilf:A\to C^B\) s.t. \(\epsilon\circ(\tilf\times 1_B)=f\)
    \begin{center}\begin{tikzcd}
    C^B\\
    A\ar[u,"\tilf"']
    \end{tikzcd}\hspace{1cm}\begin{tikzcd}
    C^B\times B\ar[r,"\epsilon"]&C\\
    A\times B\ar[u,"\tilf\times 1_B"]\ar[ur,"f"']
    \end{tikzcd}\end{center}
    #+END_definition


    #+ATTR_LATEX: :options []
    #+BEGIN_theorem
    label:3.3.22
    Let \(\bC\) be a lax computability model
    1. If \(\bC\) has a weak terminal, then \(\Asm(\bC)\) has a terminal object 1
    2. If \(\bC\) has weak products, then \(\Asm(\bC)\) has binary cartesian products
    3. If \(\bC\) weakly cartesian closed, then \(\Asm(\bC)\) is cartesian closed
    4. If \(\bC\) has a weak terminal and booleans, \(\Asm(\bC)\) has the co product \(1+1\)
    5. If \(\bC\) has a weak terminal and numerals, \(\Asm(\bC)\) has a natural number object
    #+END_theorem

    #+BEGIN_proof
    1. If \((I,i)\) is a weak terminal, define \(1=(\{i\},I,\Vdash_1=\{(i,i)\})\). Then for any \(X\in\Asm(\bC)\),
       \(f=\Lambda x.i\) is the unique morphism where \(\barf=\Lambda x.i\).
    2. [@2] If \(X\) and \(Y\) are assemblies and \rho is a weak product of \(\rho_X\) and \(\rho_Y\), define
       the assembly \(X\times Y\) by
       \begin{equation*}
       \abs{X\times Y}=\abs{X}\times\abs{Y},\quad\rho_{X\times Y}=\rho,\quad a\Vdash_{X\times Y}(x,y)\text{ iff }
       \pi_X(a)\Vdash_Xx\wedge\pi_Y(a)\Vdash_Yy
       \end{equation*}
    3. If \(X\) and \(Y\) are assemblies, let us say an element \(t\in\bC(\rho_X\to\rho_Y)\) *tracks* a
       function \(f:\abs{X}\to\abs{Y}\) if
       \begin{equation*}
       \forall x\in\abs{X},a\in\bC(\rho_X).\;a\Vdash_Xx\Rightarrow t\cdot_{XY}a\Vdash_Yf(x)
       \end{equation*}
       Now define the assembly \(Y^X\) as follows:
       \begin{align*}
       \abs{Y^X}&=\{f:\abs{X}\to\abs{Y}\mid f\text{ is tracked by some }t\in\bC(\rho_X\to\rho_Y)\}\\
       \rho_{Y^X}&=\rho_X\to\rho_Y\\
       t\Vdash_{Y^X}f&\Leftrightarrow t\text{ tracks }f
       \end{align*}
    #+END_proof

    Theorem ref:3.2.22 also holds with \(\nMod(\bC)\), and the
    inclusion \(\nMod(\bC)\hookrightarrow\Asm(\bC)\) preserves all the relevant structure
** Simulations Between Computability Models
