books/HigherOrderComputability.org
*** Simulations and Transformations
    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    Let \(\bC\) and \(\bD\) be lax computability models over type worlds \(T,U\) respectively. A
    *simulation* \gamma of \(\bC\) in \(\bD\) (written in \(\gamma:\bC\lrarhd\bD\))
    consist of
    * a mapping \(\sigma\mapsto\gamma\sigma:T\to U\)
    * for each \(\sigma\in T\), a relation \(\Vdash_\sigma^\gamma\subseteq\bD(\gamma\sigma)\times\bC(\sigma)\)
    satisfying the following
    1. For all \(a\in\bC(\sigma)\) there exists \(a'\in\bD(\gamma\sigma)\) s.t. \(a'\Vdash_\sigma^\gamma a\)
    2. Every operation \(f\in\bC[\sigma,\tau]\) is *tracked* by some \(f'\in\bD[\gamma\sigma,\gamma\tau]\), in the sense that
       whenever \(f(a)\downarrow\) and \(a'\Vdash_\sigma^\gamma a\), we have \(f'(a)\Vdash_\tau^\gamma f(a)\)
    #+END_definition

    For any \(\bC\) we have the *identity* simulation \(\id_{\bC}:\bC\lrarhd\bC\) given by \(\id_{\bC}\sigma=\sigma\)
    and \(a'\Vdash_{\sigma}^{\id_{\bC}}a\) iff \(a'=a\)

    Given simulations \(\gamma:\bC\lrarhd\bD\) and \(\delta:\bD\lrarhd\bE\) we have the composite
    simulation \(\delta\circ\gamma:\bC\lrarhd\gamma\bE\) defined by \((\delta\circ\gamma)\sigma=\delta(\gamma\sigma)\) and \(a'\Vdash_\sigma^{\delta\circ\gamma}a\)  iff there
    exists \(a''\in\bD(\gamma\sigma)\) with \(a''\Vdash_\sigma^\gamma a\) and \(a'\Vdash_{\gamma\sigma}^\delta a''\).

    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    Let \(\bC\), \(\bD\) be lax computability models and suppose \(\gamma,\delta:\bC\lrarhd\bD\) are simulations. We
    say \gamma is *transformable* to \delta, and write \(\gamma\preceq\delta\), if for each \(\sigma\in\abs{\bC}\) there is an
    operation \(t\in\bD[\gamma\sigma,\delta\sigma]\) s.t.
    \begin{equation*}
    \forall a\in\bC(\sigma),a'\in\bD(\gamma\sigma).a'\Vdash_\sigma^\gamma a\Rightarrow t(a')\Vdash_\sigma^\delta a
    \end{equation*}
    We write \(\gamma\sim\delta\) if both \(\gamma\preceq\delta\) and \(\delta\preceq\gamma\)
    #+END_definition

    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    Models \(\bC,\bD\) are *equivalent* (\(\bC\simeq\bD\)) if there exist simulations \(\gamma:\bC\lrarhd\bD\)
    and \(\delta:\bD\lrarhd\bC\) s.t. \(\delta\circ\gamma\sim\id_{\bC}\) and \(\gamma\circ\delta\sim\id_{\bD}\)
    #+END_definition

    A model is *essentially untyped* if it is equivalent to a model over the singleton type world \(\sfO\)

    #+BEGIN_exercise
    Show that a model \(\bC\) is essentially untyped iff it contains a *universal type*: that is, a
    datatype \(U\) s.t. for each \(A\in\abs{\bC}\) there exists operations \(e\in\bC[A,U]\), \(r\in\bC[U,A]\)
    with \(r(e(a))=a\) for all \(a\in A\)
    #+END_exercise

    #+BEGIN_proof
    \(\Leftarrow\): Let \(\sfO=\{U\}\). For each \(f\in\bC[A,B]\), \(\bD\) contains \(\barf\in\bD[U,U]\) s.t. \(\barf()\)
    Let
    \begin{equation*}
    \bD[U,U]=\{\barf:e[A]\to e[B]:f\in\bC[A,B]\}
    \end{equation*}
    where \(\barf(e(a))=e(f(a))\)

    each \(A\in\abs{\bC}\), let \(\gamma(A)=U\) and define \(a'\Vdash_A^\gamma a\) iff \(a'=e(a)\)
    #+END_proof

    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    Suppose \(\bC,\bD\) are lax models with weak products and weak terminals \((I,i)\), \((J,j)\)
    respectively. A simulation \(\gamma:\bC\lrarhd\bD\) is *cartesian* if
    1. for each \(\sigma,\tau\in\abs{\bC}\) there exists \(t\in\bD[\gamma\sigma\bowtie\gamma\tau,\gamma(\sigma\bowtie\tau)]\) s.t.
       \begin{gather*}
       \pi_{\gamma\sigma}(d)\Vdash_\sigma^\gamma a\wedge\pi_{\gamma\tau}(d)\Vdash_\tau^\gamma b\Rightarrow\\
       \exists c\in\bC(\sigma\bowtie\tau).\pi_\sigma(c)=a\wedge\pi_\tau(c)=b\wedge t(d)\Vdash_{\sigma\bowtie\tau}^\gamma c
       \end{gather*}
    2. there exists \(u\in\bD[J,\gamma I]\) s.t. \(u(j)\Vdash_I^\gamma i\)

    #+END_definition


    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    Let \(\bA\) and \(\bB\) be lax relative TPCAs over the type worlds \(\sfT,\sfU\) respectively. An
    *applicative simulation* \(\gamma:\bA\lrarhd\bB\) consists of
    * a mapping \(\sigma\mapsto\gamma\sigma:\sfT\to\sfU\)
    * for each \(\sigma\in\sfT\), a relation \(\Vdash_\sigma^\gamma\subseteq\bB^\circ(\gamma\sigma)\times\bA^\circ(\sigma)\)
    satisfying the following
    1. For all \(a\in\bA^\circ(\sigma)\) there exists \(b\in\bB^\circ(\gamma\sigma)\) with \(b\Vdash_\sigma^\gamma a\)
    2. For all \(a\in\bA^\sharp(\sigma)\) there exists \(b\in\bB^\sharp(\gamma\sigma)\) with \(b\Vdash_\sigma^\gamma a\)
    3. 'Application in \(\bA\) is effective in \(\bB\)': that is, for each \(\sigma,\tau\in\sfT\), there exists
       some \(r\in\bB^\sharp(\gamma(\sigma\to\tau)\to\gamma\sigma\to\gamma\tau)\), called a *realizer for \gamma at \sigma,\tau*, s.t. for
       all \(f\in\bA^\circ(\sigma\to\tau)\), \(f'\in\bB^\circ(\gamma(\sigma\to\tau))\), \(a\in\bA^\circ(\sigma)\) and \(a'\in\bB^\circ(\gamma\sigma)\) we have
       \begin{equation*}
       f'\Vdash_{\sigma\to\tau}f\wedge a'\Vdash_\sigma a\wedge f\cdot a\downarrow\Rightarrow r\cdot f'\cdot a'\Vdash_\tau f\cdot a
       \end{equation*}
    #+END_definition

    #+ATTR_LATEX: :options []
    #+BEGIN_theorem
    Suppose \(\bC\) and \(\bD\) are (lax) weakly cartesian closed models, and suppose \(\bA\) and \(\bB\)
    are the corresponding (lax) relative TPCAs with pairing via the correspondence of Theorem
    ref:3.1.18. Then cartesian simulations \(\bC\lrarhd\bD\) correspond precisely to applicative
    simulations \(\bA\lrarhd\bB\)
    #+END_theorem

    #+BEGIN_proof
    Suppose first that \(\gamma:\bC\lrarhd\bD\) is a cartesian simulation
    1. Definition
    2. Suppose \(a\in\bA^\sharp(\sigma)\) where \(\bA^\circ(\sigma)=A\). Then we may
       find \(g\in\bC[I,A]\) with \(g(i)=a\), where \((I,i)\) is a weak terminal in \(\bC\).
       Take \(g'\in\bD[\gamma I,\gamma A]\) tracking \(g\), and compose it with \(u\in\bD[J,\gamma I]\), we
       obtain \(g''\in\bD[J,\gamma A]\). Then \(g''(j)\in\bB^\sharp(\gamma\sigma)\), and it is easy to see
       that \(g''(j)\Vdash_\sigma^\gamma a\)
    3. Let \(\sigma,\tau\) be any types; then by the definition of weakly cartesian closedness, we
       have \(app_{\sigma\tau}\in\bC[(\sigma\to\tau)\times\sigma,\tau]\) tracked by some \(app_{\sigma\tau}'\in\bD[\gamma((\sigma\to\tau)\times\sigma),\gamma\tau]\). By definition
       of cartesian simulation, we have \(t\in\bD[\gamma(\sigma\to\tau)\times\gamma\sigma,\gamma((\sigma\to\tau)\times\sigma)]\), we have an operation
       \(\bD[\gamma(\sigma\to\tau)\times\gamma\sigma,\gamma\tau]\), and hence an operation \(\bD[\gamma(\sigma\to\tau),\gamma\sigma\to\gamma\tau]\), and then
       an operation \(\bD[J, \gamma(\sigma\to\tau)\to\gamma\sigma\to\gamma\tau]\), and hence
       realizer \(r\in\bB^\sharp(\gamma(\sigma\to\tau)\to\gamma\sigma\to\gamma\tau)\) with the required properties:
       for all \(f\in\bA^\circ(\sigma\to\tau)\), \(f'\in\bB^\circ(\gamma(\sigma\to\tau))\), \(a\in\bA^\circ(\sigma)\), \(a'\in\bB^\circ(\gamma\sigma)\),
       and \(f'\Vdash_{\sigma\to\tau}f\), \(a'\Vdash_\sigma a\), \(f\cdot a\downarrow\), we
       have \(t(f',a')\Vdash_{(\sigma\to\tau)\times\sigma}(f,a)\).
       Then \(app'_{\sigma\tau}(t(f',a'))\Vdash_{\tau}^\gamma app_{\sigma\tau}(f,a)\)


    Conversely, suppose \(\gamma:\bA\lrarhd\bB\) is an applicative simulation. To see that \gamma is a
    simulation \(\bC\lrarhd\bD\), it suffices to show that every operation in \(\bC\) is tracked by one
    in \(\bD\). But given \(f\in\bC[\sigma,\tau]\), we may find a corresponding element \(a\in\bA^\sharp(\sigma\to\tau)\), whence
    some \(a'\in\bB^\sharp(\gamma(\sigma\to\tau))\) with \(a'\Vdash^\gamma_{\sigma\to\tau}a\); by using a realizer \(r\in\bB^\sharp\) for \gamma at \sigma,\tau,
    we have an element \(a''\in\bB^\sharp(\gamma\sigma\to\gamma\tau)\)  and so a corresponding operation \(f'\in\bD[\gamma\sigma,\gamma\tau]\).

    It remains to show that \gamma is cartesian. For any types \sigma,\tau, we have by assumption an element
    \(pair_{\sigma\tau}\in\bA^\sharp(\sigma\to\tau\to\sigma\times\tau)\), yielding some \(p\in\bC[\sigma,\tau\to\sigma\times\tau]\). Since \gamma is a simulation, this is
    tracked by some \(p'\in\bD[\gamma\sigma,\gamma(\tau\to\sigma\times\tau)]\). From the weak product structure in \(\bD\) we may thence
    obtain an operation
    \begin{equation*}
    p''\in\bD[\gamma\sigma\times\gamma\tau,\gamma(\tau\to\sigma\times\tau)\times\gamma\tau]
    \end{equation*}
    and together with a realizer for \gamma at \tau and \(\sigma\times\tau\), this yields an
    operation \(t\in\bD[\gamma\sigma\times\gamma\tau,\gamma(\sigma\times\tau)]\) with the required properties.

    \(i\in\bA^\sharp(I)\), hence there is \(b\in\bB^\sharp(\gamma I)\) with \(b\Vdash_I^\gamma i\). But \(b=u(j)\) for
    some \(u\in\bD[J,\gamma I]\)
    #+END_proof

    The notion of a transformation between simulations carries across immediately to the relative
    TPCA setting: an applicative simulation \(\gamma:\bA\lrarhd\bB\) is transformable to \delta if for each type
    \sigma there exists \(t\in\bB^\sharp(\gamma\sigma\to\delta\sigma)\) s.t. \(a'\Vdash_\sigma^\gamma a\) implies \(t\cdot a'\Vdash_\sigma^\delta a\)

    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    Suppose \(\bA\) and \(\bB\) are (lax) relative TPCAs over \(\sfT\) and \(\sfU\) respectively, and
    suppose \(\gamma:\bA\lrarhd\bB\) is an applicative simulation
    1. \gamma is *discrete* if \(b\Vdash^\gamma a\) and \(b\Vdash^\gamma a'\) imply \(a=a'\)
    2. \gamma is *single-valued* if for all \(a\in\bA\) there is exactly one \(b\in\bB\) with \(b\Vdash^\gamma a\). \gamma is
       *projective* if \(\gamma\sim\gamma'\) for some single-valued \(\gamma'\)
    3. If \(\bA\) and \(\bB\) have booleans \(\TT_{\bA}\), \(\FF_{\bA}\) and \(\TT_{\bB}\), \(\FF_{\bB}\)
       respectively, \gamma *respects booleans* if there exists \(q\in\bB^\sharp\) s.t.
       \begin{equation*}
       b\Vdash^\gamma\TT_{\bA}\Rightarrow q\cdot b=\TT_{\bB},\quad b\Vdash^\gamma\FF_{\bA}\Rightarrow q\cdot b=\FF_{\bB}
       \end{equation*}
    4. If \(\bA\) and \(\bB\) have numerals \(\hatn\) and \(\tiln\) respectively, \gamma *respects numerals* if
       there exists \(q\in\bB^\sharp\) s.t. for all \(n\in\N\)
       \begin{equation*}
       b\Vdash^\gamma\hatn\Rightarrow q\cdot b=\tiln
       \end{equation*}
    5. If \(\sfT=\sfU\), we say \gamma is *type-respecting* if \gamma is the identity on types, and moreover:
       * \(\Vdash_\sigma^\gamma=\id_{\sfT[\sigma]}\) whenever \(\sfT\) fixes the interpretation of \sigma
       * Application is itself a realizer for \gamma at each \(\sigma,\tau\): that is,
         \begin{equation*}
         f'\Vdash_{\sigma\to\tau}^\gamma f\wedge a'\Vdash_\sigma^\gamma a\wedge f\cdot a\downarrow\Rightarrow f'\cdot a'\Vdash_\tau^\gamma f\cdot a
         \end{equation*}
       * If \(\sfT\) has product structure, then \(\bA,\bB\) have pairing and
         \begin{align*}
         a'\Vdash_\sigma^\gamma a\wedge b'\Vdash_\tau^\gamma b&\Rightarrow pair\cdot a'\cdot b'\Vdash_{\sigma\times\tau}^\gamma pair\cdot a\cdot b\\
         d'\Vdash_{\sigma\times\tau}^\gamma d&\Rightarrow fst\cdot d'\Vdash_\sigma^\gamma fst\cdot d\wedge snd\cdot d'\Vdash_\sigma^\gamma snd\cdot d
         \end{align*}
    #+END_definition

    #+BEGIN_remark
    Show that if \gamma respects numerals then \gamma respects booleans
    #+END_remark

