latex/HigherOrderComputability/HigherOrderComputability.tex
\subsubsection{Simulations and Transformations}
\label{sec:org1530e10}
\begin{definition}[]
Let \(\bC\) and \(\bD\) be lax computability models over type worlds \(T,U\) respectively. A
\textbf{simulation} \(\gamma\) of \(\bC\) in \(\bD\) (written in \(\gamma:\bC\lrarhd\bD\))
consist of
\begin{itemize}
\item a mapping \(\sigma\mapsto\gamma\sigma:T\to U\)
\item for each \(\sigma\in T\), a relation \(\Vdash_\sigma^\gamma\subseteq\bD(\gamma\sigma)\times\bC(\sigma)\)
\end{itemize}
satisfying the following
\begin{enumerate}
\item For all \(a\in\bC(\sigma)\) there exists \(a'\in\bD(\gamma\sigma)\) s.t. \(a'\Vdash_\sigma^\gamma a\)
\item Every operation \(f\in\bC[\sigma,\tau]\) is \textbf{tracked} by some \(f'\in\bD[\gamma\sigma,\gamma\tau]\), in the sense that
whenever \(f(a)\downarrow\) and \(a'\Vdash_\sigma^\gamma a\), we have \(f'(a)\Vdash_\tau^\gamma f(a)\)
\end{enumerate}
\end{definition}

For any \(\bC\) we have the \textbf{identity} simulation \(\id_{\bC}:\bC\lrarhd\bC\) given by \(\id_{\bC}\sigma=\sigma\)
and \(a'\Vdash_{\sigma}^{\id_{\bC}}a\) iff \(a'=a\)

Given simulations \(\gamma:\bC\lrarhd\bD\) and \(\delta:\bD\lrarhd\bE\) we have the composite
simulation \(\delta\circ\gamma:\bC\lrarhd\gamma\bE\) defined by \((\delta\circ\gamma)\sigma=\delta(\gamma\sigma)\) and \(a'\Vdash_\sigma^{\delta\circ\gamma}a\)  iff there
exists \(a''\in\bD(\gamma\sigma)\) with \(a''\Vdash_\sigma^\gamma a\) and \(a'\Vdash_{\gamma\sigma}^\delta a''\).

\begin{definition}[]
Let \(\bC\), \(\bD\) be lax computability models and suppose \(\gamma,\delta:\bC\lrarhd\bD\) are simulations. We
say \(\gamma\) is \textbf{transformable} to \(\delta\), and write \(\gamma\preceq\delta\), if for each \(\sigma\in\abs{\bC}\) there is an
operation \(t\in\bD[\gamma\sigma,\delta\sigma]\) s.t.
\begin{equation*}
\forall a\in\bC(\sigma),a'\in\bD(\gamma\sigma).a'\Vdash_\sigma^\gamma a\Rightarrow t(a')\Vdash_\sigma^\delta a
\end{equation*}
We write \(\gamma\sim\delta\) if both \(\gamma\preceq\delta\) and \(\delta\preceq\gamma\)
\end{definition}

\begin{definition}[]
Models \(\bC,\bD\) are \textbf{equivalent} (\(\bC\simeq\bD\)) if there exist simulations \(\gamma:\bC\lrarhd\bD\)
and \(\delta:\bD\lrarhd\bC\) s.t. \(\delta\circ\gamma\sim\id_{\bC}\) and \(\gamma\circ\delta\sim\id_{\bD}\)
\end{definition}

A model is \textbf{essentially untyped} if it is equivalent to a model over the singleton type world \(\sfO\)

\begin{exercise}
Show that a model \(\bC\) is essentially untyped iff it contains a \textbf{universal type}: that is, a
datatype \(U\) s.t. for each \(A\in\abs{\bC}\) there exists operations \(e\in\bC[A,U]\), \(r\in\bC[U,A]\)
with \(r(e(a))=a\) for all \(a\in A\)
\end{exercise}

\begin{proof}
\(\Leftarrow\): Let \(\sfO=\{U\}\). For each \(f\in\bC[A,B]\), \(\bD\) contains \(\barf\in\bD[U,U]\) s.t. \(\barf()\)
Let
\begin{equation*}
\bD[U,U]=\{\barf:e[A]\to e[B]:f\in\bC[A,B]\}
\end{equation*}
where \(\barf(e(a))=e(f(a))\)

each \(A\in\abs{\bC}\), let \(\gamma(A)=U\) and define \(a'\Vdash_A^\gamma a\) iff \(a'=e(a)\)
\end{proof}

\begin{definition}[]
Suppose \(\bC,\bD\) are lax models with weak products and weak terminals \((I,i)\), \((J,j)\)
respectively. A simulation \(\gamma:\bC\lrarhd\bD\) is \textbf{cartesian} if
\begin{enumerate}
\item for each \(\sigma,\tau\in\abs{\bC}\) there exists \(t\in\bD[\gamma\sigma\bowtie\gamma\tau,\gamma(\sigma\bowtie\tau)]\) s.t.
\begin{gather*}
\pi_{\gamma\sigma}(d)\Vdash_\sigma^\gamma a\wedge\pi_{\gamma\tau}(d)\Vdash_\tau^\gamma b\Rightarrow\\
\exists c\in\bC(\sigma\bowtie\tau).\pi_\sigma(c)=a\wedge\pi_\tau(c)=b\wedge t(d)\Vdash_{\sigma\bowtie\tau}^\gamma c
\end{gather*}
\item there exists \(u\in\bD[J,\gamma I]\) s.t. \(u(j)\Vdash_I^\gamma i\)
\end{enumerate}
\end{definition}


\begin{definition}[]
Let \(\bA\) and \(\bB\) be lax relative TPCAs over the type worlds \(\sfT,\sfU\) respectively. An
\textbf{applicative simulation} \(\gamma:\bA\lrarhd\bB\) consists of
\begin{itemize}
\item a mapping \(\sigma\mapsto\gamma\sigma:\sfT\to\sfU\)
\item for each \(\sigma\in\sfT\), a relation \(\Vdash_\sigma^\gamma\subseteq\bB^\circ(\gamma\sigma)\times\bA^\circ(\sigma)\)
\end{itemize}
satisfying the following
\begin{enumerate}
\item For all \(a\in\bA^\circ(\sigma)\) there exists \(b\in\bB^\circ(\gamma\sigma)\) with \(b\Vdash_\sigma^\gamma a\)
\item For all \(a\in\bA^\sharp(\sigma)\) there exists \(b\in\bB^\sharp(\gamma\sigma)\) with \(b\Vdash_\sigma^\gamma a\)
\item 'Application in \(\bA\) is effective in \(\bB\)': that is, for each \(\sigma,\tau\in\sfT\), there exists
some \(r\in\bB^\sharp(\gamma(\sigma\to\tau)\to\gamma\sigma\to\gamma\tau)\), called a \textbf{realizer for \(\gamma\) at \(\sigma\),\(\tau\)}, s.t. for
all \(f\in\bA^\circ(\sigma\to\tau)\), \(f'\in\bB^\circ(\gamma(\sigma\to\tau))\), \(a\in\bA^\circ(\sigma)\) and \(a'\in\bB^\circ(\gamma\sigma)\) we have
\begin{equation*}
f'\Vdash_{\sigma\to\tau}f\wedge a'\Vdash_\sigma a\wedge f\cdot a\downarrow\Rightarrow r\cdot f'\cdot a'\Vdash_\tau f\cdot a
\end{equation*}
\end{enumerate}
\end{definition}

\begin{theorem}[]
Suppose \(\bC\) and \(\bD\) are (lax) weakly cartesian closed models, and suppose \(\bA\) and \(\bB\)
are the corresponding (lax) relative TPCAs with pairing via the correspondence of Theorem
\ref{3.1.18}. Then cartesian simulations \(\bC\lrarhd\bD\) correspond precisely to applicative
simulations \(\bA\lrarhd\bB\)
\end{theorem}

\begin{proof}
Suppose first that \(\gamma:\bC\lrarhd\bD\) is a cartesian simulation
\begin{enumerate}
\item Definition
\item Suppose \(a\in\bA^\sharp(\sigma)\) where \(\bA^\circ(\sigma)=A\). Then we may
find \(g\in\bC[I,A]\) with \(g(i)=a\), where \((I,i)\) is a weak terminal in \(\bC\).
Take \(g'\in\bD[\gamma I,\gamma A]\) tracking \(g\), and compose it with \(u\in\bD[J,\gamma I]\), we
obtain \(g''\in\bD[J,\gamma A]\). Then \(g''(j)\in\bB^\sharp(\gamma\sigma)\), and it is easy to see
that \(g''(j)\Vdash_\sigma^\gamma a\)
\item Let \(\sigma,\tau\) be any types; then by the definition of weakly cartesian closedness, we
have \(app_{\sigma\tau}\in\bC[(\sigma\to\tau)\times\sigma,\tau]\) tracked by some \(app_{\sigma\tau}'\in\bD[\gamma((\sigma\to\tau)\times\sigma),\gamma\tau]\). By definition
of cartesian simulation, we have \(t\in\bD[\gamma(\sigma\to\tau)\times\gamma\sigma,\gamma((\sigma\to\tau)\times\sigma)]\), we have an operation
\(\bD[\gamma(\sigma\to\tau)\times\gamma\sigma,\gamma\tau]\), and hence an operation \(\bD[\gamma(\sigma\to\tau),\gamma\sigma\to\gamma\tau]\), and then
an operation \(\bD[J, \gamma(\sigma\to\tau)\to\gamma\sigma\to\gamma\tau]\), and hence
realizer \(r\in\bB^\sharp(\gamma(\sigma\to\tau)\to\gamma\sigma\to\gamma\tau)\) with the required properties:
for all \(f\in\bA^\circ(\sigma\to\tau)\), \(f'\in\bB^\circ(\gamma(\sigma\to\tau))\), \(a\in\bA^\circ(\sigma)\), \(a'\in\bB^\circ(\gamma\sigma)\),
and \(f'\Vdash_{\sigma\to\tau}f\), \(a'\Vdash_\sigma a\), \(f\cdot a\downarrow\), we
have \(t(f',a')\Vdash_{(\sigma\to\tau)\times\sigma}(f,a)\).
Then \(app'_{\sigma\tau}(t(f',a'))\Vdash_{\tau}^\gamma app_{\sigma\tau}(f,a)\)
\end{enumerate}


Conversely, suppose \(\gamma:\bA\lrarhd\bB\) is an applicative simulation. To see that \(\gamma\) is a
simulation \(\bC\lrarhd\bD\), it suffices to show that every operation in \(\bC\) is tracked by one
in \(\bD\). But given \(f\in\bC[\sigma,\tau]\), we may find a corresponding element \(a\in\bA^\sharp(\sigma\to\tau)\), whence
some \(a'\in\bB^\sharp(\gamma(\sigma\to\tau))\) with \(a'\Vdash^\gamma_{\sigma\to\tau}a\); by using a realizer \(r\in\bB^\sharp\) for \(\gamma\) at \(\sigma\),\(\tau\),
we have an element \(a''\in\bB^\sharp(\gamma\sigma\to\gamma\tau)\)  and so a corresponding operation \(f'\in\bD[\gamma\sigma,\gamma\tau]\).

It remains to show that \(\gamma\) is cartesian. For any types \(\sigma\),\(\tau\), we have by assumption an element
\(pair_{\sigma\tau}\in\bA^\sharp(\sigma\to\tau\to\sigma\times\tau)\), yielding some \(p\in\bC[\sigma,\tau\to\sigma\times\tau]\). Since \(\gamma\) is a simulation, this is
tracked by some \(p'\in\bD[\gamma\sigma,\gamma(\tau\to\sigma\times\tau)]\). From the weak product structure in \(\bD\) we may thence
obtain an operation
\begin{equation*}
p''\in\bD[\gamma\sigma\times\gamma\tau,\gamma(\tau\to\sigma\times\tau)\times\gamma\tau]
\end{equation*}
and together with a realizer for \(\gamma\) at \(\tau\) and \(\sigma\times\tau\), this yields an
operation \(t\in\bD[\gamma\sigma\times\gamma\tau,\gamma(\sigma\times\tau)]\) with the required properties.

\(i\in\bA^\sharp(I)\), hence there is \(b\in\bB^\sharp(\gamma I)\) with \(b\Vdash_I^\gamma i\). But \(b=u(j)\) for
some \(u\in\bD[J,\gamma I]\)
\end{proof}

The notion of a transformation between simulations carries across immediately to the relative
TPCA setting: an applicative simulation \(\gamma:\bA\lrarhd\bB\) is transformable to \(\delta\) if for each type
\(\sigma\) there exists \(t\in\bB^\sharp(\gamma\sigma\to\delta\sigma)\) s.t. \(a'\Vdash_\sigma^\gamma a\) implies \(t\cdot a'\Vdash_\sigma^\delta a\)

\begin{definition}[]
Suppose \(\bA\) and \(\bB\) are (lax) relative TPCAs over \(\sfT\) and \(\sfU\) respectively, and
suppose \(\gamma:\bA\lrarhd\bB\) is an applicative simulation
\begin{enumerate}
\item \(\gamma\) is \textbf{discrete} if \(b\Vdash^\gamma a\) and \(b\Vdash^\gamma a'\) imply \(a=a'\)
\item \(\gamma\) is \textbf{single-valued} if for all \(a\in\bA\) there is exactly one \(b\in\bB\) with \(b\Vdash^\gamma a\). \(\gamma\) is
\textbf{projective} if \(\gamma\sim\gamma'\) for some single-valued \(\gamma'\)
\item If \(\bA\) and \(\bB\) have booleans \(\TT_{\bA}\), \(\FF_{\bA}\) and \(\TT_{\bB}\), \(\FF_{\bB}\)
respectively, \(\gamma\) \textbf{respects booleans} if there exists \(q\in\bB^\sharp\) s.t.
\begin{equation*}
b\Vdash^\gamma\TT_{\bA}\Rightarrow q\cdot b=\TT_{\bB},\quad b\Vdash^\gamma\FF_{\bA}\Rightarrow q\cdot b=\FF_{\bB}
\end{equation*}
\item If \(\bA\) and \(\bB\) have numerals \(\hatn\) and \(\tiln\) respectively, \(\gamma\) \textbf{respects numerals} if
there exists \(q\in\bB^\sharp\) s.t. for all \(n\in\N\)
\begin{equation*}
b\Vdash^\gamma\hatn\Rightarrow q\cdot b=\tiln
\end{equation*}
\item If \(\sfT=\sfU\), we say \(\gamma\) is \textbf{type-respecting} if \(\gamma\) is the identity on types, and moreover:
\begin{itemize}
\item \(\Vdash_\sigma^\gamma=\id_{\sfT[\sigma]}\) whenever \(\sfT\) fixes the interpretation of \(\sigma\)
\item Application is itself a realizer for \(\gamma\) at each \(\sigma,\tau\): that is,
\begin{equation*}
f'\Vdash_{\sigma\to\tau}^\gamma f\wedge a'\Vdash_\sigma^\gamma a\wedge f\cdot a\downarrow\Rightarrow f'\cdot a'\Vdash_\tau^\gamma f\cdot a
\end{equation*}
\item If \(\sfT\) has product structure, then \(\bA,\bB\) have pairing and
\begin{align*}
a'\Vdash_\sigma^\gamma a\wedge b'\Vdash_\tau^\gamma b&\Rightarrow pair\cdot a'\cdot b'\Vdash_{\sigma\times\tau}^\gamma pair\cdot a\cdot b\\
d'\Vdash_{\sigma\times\tau}^\gamma d&\Rightarrow fst\cdot d'\Vdash_\sigma^\gamma fst\cdot d\wedge snd\cdot d'\Vdash_\sigma^\gamma snd\cdot d
\end{align*}
\end{itemize}
\end{enumerate}
\end{definition}

\begin{remark}
Show that if \(\gamma\) respects numerals then \(\gamma\) respects booleans
\end{remark}
