books/HigherOrderComputability.org
*** Simulations and Assemblies
    A simulation \(\gamma:\bC\lrarhd\bD\) naturally induces a functor \(\gamma_*:\Asm(\bC)\to\Asm(\bD)\) , capturing the
    evident idea that any datatypes implementable within \(\bC\) must also be implementable in \(\bD\)
    * On objects \(X\), define \(\gamma_*(X)\) by \(\abs{\gamma_*(X)}=\abs{X}\), \(\rho_{\gamma_*(X)}=\gamma\rho_X\)
      and \(b\Vdash_{\gamma_*(X)}x\) iff \(\exists a\in\bC(\rho_X)\), \(a\Vdash_Xx\wedge b\Vdash_{\rho_X}^\gamma a\)
    * On morphisms \(f:X\to Y\), define \(\gamma_*(f)=f\). Note that if \(r\in\bC[\rho_X,\rho_Y]\) tracks \(f\) as a
      morphism in \(\Asm(\bC)\), and \(r'\in\bD[\gamma\rho_X,\gamma\rho_Y]\) tracks \(r\) w.r.t. \gamma, then \(r'\)
      tracks \(f\) as a morphism in \(\Asm(\bC)\)


    Moreover, a transformation \(\xi:\gamma\to\delta\) yields a natural transformation \(\xi_*:\gamma_*\to\delta_*\): just
    take \(\xi_{*X}=\id_{\abs{X}}:\gamma_*(X)\to\delta_*​ (X)\), and note that if \(t\) witnesses \(\gamma\preceq\delta\) at \(X\),
    then \(t\) tracks \(\xi_{*​X}\).

    #+ATTR_LATEX: :options []
    #+BEGIN_definition
    1. \gamma respects numerals iff \(\gamma_*\) preserves the natural number object
    #+END_definition

