books/HigherOrderComputability.org
** Examples of Simulations and Transformations
    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    Suppose \(\bC\) is any (lax) computability model with weak products, and consider the following
    variation on the 'product completion' construction described in the proof of Theorem ref:3.1.15.
    Let \(\bC^\times\) be the computability model whose datatypes are sets \(A_0\times\dots\times A_{m-1}\)
    where \(A_i\in\abs{\bC}\), and whose operations \(f\in\bC^\times[A_0\times\dots\times A_{m-1},B_0\times\dots\times B_{n-1}]\) are those
    partial functions represented by some operation in \(\bC[A_0\bowtie\dots\bowtie A_{m-1},B_0\bowtie\dots\bowtie B_{n-1}]\). Clearly
    the inclusion \(\bC\hookrightarrow\bC^\times\) and \(\bC^\times\to\bC\) sending \(A_0\times\dots A_{m-1}\) to \(A_0\bowtie\dots\bowtie A_{m-1}\) are
    simulations. Moreover, they constitute an equivalence \(\bC\simeq\bC^\times\). This shows that every strict
    (lax) computability model with weak products is equivalent to one with standard products
    #+END_examplle

    #+ATTR_LATEX: :options []
    #+BEGIN_proposition
    For any partial computable \(f:\N^r\rhu\N\) there is an applicative
    expression \(e_f:\ttN^{(r)}\to\ttN\) (involving constants 0, suc, \(rec_{\ttN}\), min) s.t. in any
    model \(\bA\) with numerals and minimization we have \(\llb{e_f}_v\in\bA^\sharp\) (with the obvious
    valuation \(v\)) and
    \begin{equation*}
    \forall n_0,\dots,n_{r-1},m. f(n_0,\dots,n_{r-1})=m\Rightarrow\llb{e_f}_v\cdot\hatn_0\cdot\dots\cdot\hatn_{r-1}=\hatm
    \end{equation*}
    #+END_proposition

    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    Let \(\bA\) be any untyped (lax relative) PCA, or more generally any model with
    numerals \(\bar{0},\bar{1},\dots\) and minimization. We may then define a single-valued applicative
    simulation \(\kappa:K_1\lrarhd\bA\) by taking \(a\Vdash^\kappa n\) iff \(a=\hat{n}\). Condition 3 is
    satisfied because the application operation \(\cdot:\N\times\N\rhu\N\) of \(K_1\) is representable by an
    element of \(\bA^\sharp\)

    Model with single datatype \(\N\) and whose operations \(\N\rightharpoonup\N\) are precisely the
    Turing-computable partial functions. \(K_1\)is weakly cartesian closed.

    For any partial computable \(f:\N^r\rhu\N\) there is an applicative
    expression \(e_f:\ttN^{(r)}\to\ttN\) (involving constants 0, suc, \(rec_{\ttN}\), min) s.t. in any
    model \(\bA\) with numerals and minimization we have \(\llb{e_f}_v\in\bA^\sharp\) (with the obvious
    valuation \(v\)) and
    \begin{equation*}
    \forall n_0,\dots,n_{r-1},m. f(n_0,\dots,n_{r-1})=m\Rightarrow\llb{e_f}_v\cdot\hatn_0\cdot\dots\cdot\hatn_{r-1}=\hatm
    \end{equation*}

    In particular models, many choices of numerals may be available. For instance, if \(\bA=\bA^\sharp=\Lambda/\sim\),
    then besides the /Curry numerals/, we also have the *Church numerals* \(\tiln=\lambda f.\lambda x.f^nx\)
    #+END_examplle

    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    The model \(\Lambda^0/=\beta\) consisting of closed \lambda-terms modulo \beta-equivalence. Let \(\ceil{-}\) be
    any effective *Gödel numbering* of \lambda-terms as natural numbers, and define \(\gamma:\Lambda^0/=_\beta\lrarhd K_1\) by
    \begin{equation*}
    m\Vdash^\gamma[M]\quad\text{ iff }\quad m=\ceil{M'}\text{ for some }M'=_\beta M
    \end{equation*}
    Justaposition of \lambda-terms is tracked by a computable function \((\ceil{M},\ceil{N})\mapsto\ceil{MN}\)
    at the level of Gödel numbers. Thus \gamma is applicative

    We have transformations \(\id_{K_1}\preceq\gamma\circ\kappa\) and \(\gamma\circ\kappa\preceq\id_{K_1}\); these correspond to the
    observation that the 'encoding' and 'decoding' mappings \(n\mapsto\ceil{\hatn}\)
    and \(\ceil{\hatn}\mapsto n\)
    are computable. Also there is a term \(P\in\Lambda^0\) s.t. \(P(\what{\ceil{M}})=_\beta M\) for any \(M\in\Lambda^0\) by
    Kleene's enumeration theorem, therefore \(\kappa\circ\gamma\preceq\id_{\Lambda^0/=_\beta}\)

    However we don't have \(\id_{\Lambda^0/=_\beta}\preceq\kappa\circ\gamma\)

    It can be easily shown that \(K_1\) is not equivalent to \(\Lambda^0/=_\beta\). Let us say a relative
    PCA \(\bA\) has *decidable equality* if there is an element \(q\in\bA^\sharp\) s.t.
    \begin{equation*}
    q\cdot x\cdot y=
    \begin{cases}
    \TT&x=y\\
    \FF&\text{otherwise}
    \end{cases}
    \end{equation*}
    Clearly \(K_1\) has decidable equality, and it is easy t see that if \(\bA\simeq\bB\) then \(\bA\) has
    decidable equality iff \(\bB\) does. However, if a total relative PCA \(\bA\) were to contain such
    an element, we could define \(v=Y(q\;\FF)\) so that \(v=q\;\FF\;v\) which would yield a
    contradiction

    Here \(Y\;f=f(Y\; f)\)
    #+END_examplle



    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    We may translate System T terms \(M\) to PCF terms \(M^\theta\) simply by replacing all
    constants \(rec_\sigma\) by suitable implementations of these recursors in PCF

    In any untyped model, let \(Z\) be a guarded recursion operator,
    define
    \begin{equation*}
    R=\lambda rxfm.\IF(iszero\;m)(kx)(\lambda y.f(pre\;m))(rxf(pre\; m)\hat{0})
    \end{equation*}
    and take \(rec=\lambda xfm.(ZR)xfmi\).

    Such a translation induces a type-respecting applicative
    simulation \(\theta:\tT^0/=_{op}\lrarhd \PCF^0/=_{op}\). This simulation is single-valued
    as \(M=_{op}M'\Rightarrow M^\theta=_{op}M'^\theta\). It is easy to see that \theta respects numerals
    #+END_examplle

    #+ATTR_LATEX: :options []
    #+BEGIN_examplle
    We may also translate PCF into the untyped \lambda-calculus. One such translation \phi may be defined on
    constants as follows. We write \(\la M,N\ra\) for \(pair\;M\;N\) and
    define \(\hat{0}=\la\lambda xy.x,\lambda xy.x\) and \(\what{n+1}=\la\lambda xy.y,\hatn\ra\)
    \begin{align*}
    \hatn^\phi&=\hatn\\
    suc^\phi&=\lambda z.\la\lambda xy.y,z\ra\\
    pre^\phi&=\lambda z.(fst\;z)\hat{0}(snd\;z)\\
    ifzero^\phi&=fst\\
    Y_\sigma^\phi&=(\lambda xy.y(xxy))(\lambda xy.y(xxy))
    \end{align*}
    This induces an applicative simulation \(\phi:\PCF^0/=_{op}\lrarhd\Lambda^0/=_\beta\) respecting numerals.
    Moreover if \(M=_{op}M'\) then \(M^\phi=_\beta M'^\phi\)
    #+END_examplle

    #+ATTR_LATEX: :options [Interpretations of System \(T\)]
    #+BEGIN_examplle
    Let \(\bA\) be any total relative TPCA with numerals \(\hat{0},\hat{1},\dots\) of type \(\ttN\), and
    associated operations \(suc\), \(rec_\sigma\). To any closed term \(M:\sigma\) in Gödel's System \(T\), we
    may associate an element \(\llb{M}\in\bA^\sharp(\sigma)\) as follows: replace each occurrence of \lambda by \(\lambda^*\)
    to obtain a meta-expression \(M^*\), then expand \(M^*\) to an applicative expression \(M^\dag\)
    and evaluate it in \(\bA\), interpreting the constants \(\hat{0}\), \(suc\), \(rec_\sigma\) in the
    obvious way

    Clearly \(\llb{MN}=\llb{M}\cdot\llb{N}\) and if \(M\rightsquigarrow M'\) then \(\llb{M}=\llb{M'}\). We therefore
    obtain a type-respecting simulation \(\llb{-}:T^0/=_{op}\lrarhd\bA\)

    Now suppose \(\gamma:\bA\lrarhd\bB\) is a type- and numeral-respecting applicative simulation between
    total models with numerals. By the above, we have applicative simulations
    \(\llb{-}_{\bA}:\tT^0/=_{op}\lrarhd\bA\) and \(\llb{-}_{\bB}:\tT^0/=_{op}\lrarhd\bB\), but it nee not in
    general be the case that \(\gamma\circ\llb{-}_{\bA}\sim\llb{-}_{\bB}\). This shows that a model \(\bB\) may in
    general admit several inequivalent applicative simulations of \(\tT^0/=_{op}\)
    #+END_examplle

    #+ATTR_LATEX: :options [Interpretations of PCF]
    #+BEGIN_examplle
    Let \(\bA\) be any strict relative TPCA with numerals and general recursion. Since \(\bA\) contains
    elements playing playing the role of the PCF constants \(\hatn\), \(suc\), \(pre\), \(ifzero\)
    and \(Y_\sigma\), we may translate closed PCF terms \(M:\sigma\) into expressions \(\tilM:\sigma\) over \(A\)
    by simply replacing \lambda with \(\lambda^*\) and expanding. Note that \(M=_{op}M'\)
    implies \(\llb{\tilM}\simeq\llb{\tilM'}\) in \(\bA\). This does not itself give us an applicative
    simulation \(\PCF^0/=_{op}\lrarhd\bA\) since \(\llb{\tilM}\) may sometimes be undefined. However,
    we may obtain such a simulation \(\theta_{\bA}\) via a suspension trick: let \(\theta_{\bA}\sigma=\N\to\sigma\) for each \sigma,
    and take \(a\Vdash_\sigma^{\theta_{\bA}}[M]\) iff \(a\cdot\hat{0}\simeq\llb{\tilM}\). (For example, we
    have \(\llb{\lambda^*u.\tilM}\Vdash[M]\) for any \(M\)) \(\theta_{\bA}\) is an applicative morphism, being
    realized at each \sigma, \tau by \(\lambda^*fxu.(fu)(xu)\)
    #+END_examplle
