latex/HigherOrderComputability/HigherOrderComputability.tex
\subsubsection{Effective and Continuous Models}
\label{sec:org609a5ad}
It is natural to want to identify a class of computability models that are genuinely
‘effective’, in the sense that their data can be represented in some reasonable finitary way
and their operations are ultimately implementable on a Turing machine.

\begin{definition}[]
An \textbf{effective (relative) TPCA} is a (relative) TPCA \(\bA\) with numerals equipped with a
numeral-respecting applicative simulation \(\gamma:\bA\lrarhd K_1\)
\end{definition}

Syntactic models in general, such as \(\Lambda^0/\sim\) is effective TPCAs: The simulation \(\gamma\) is given by a
Gödel numbering of syntactic terms.

We may define \(\gamma:K_2^{\eff}\lrarhd K_1\) by setting \(m\Vdash^\gamma f\) iff \(\forall n.m\cdot n=f(n)\)

\begin{examplle}[]
The following shows what can happen if the numeral-respecting condition in definition is
omitted. Let \(f:\N\to\N\) be some fixed non-computable function. The definition of \(K_1\) may be
relativized to \(f\) as follows: let \(T_0',T_1',\dots\) be a sensibly chosen enumeration of all
Turing machines equipped with an \emph{oracle} for \(f\), so that a computation may ask for the value
of some \(f(m)\) as a single step. Now take \(e\cdot^fn\) to be the result of applying \(T_e'\) to the
input \(n\), and let \(K_1^f=(\N,\cdot^f)\). The proof that \(K_1\) is a PCA readily carries over
to \(K_1^f\)

There is an applicative simulation \(\gamma:K_1^f\lrarhd K_1\): we may take \(m\Vdash^\gamma n\) iff \(m\cdot^f0=n\)
\end{examplle}

\begin{definition}[]
A \textbf{continuous (relative) TPCA} is a (relative) TPCA \(\bA\) with numerals equipped with a
numeral-respecting applicative simulation \(\gamma:\bA\lrarhd K_2\)
\end{definition}

\begin{definition}[]
A continuous TPCA \((\bA,\gamma)\) is \textbf{full continuous} if the following hold:
\begin{enumerate}
\item For every \(f:\N\to\N\) there is some \(a\in\bA(\ttN\to\ttN)\) that represents \(f\)
\item Moreover, a realizer for some such \(a\) may be computed from \(f\) within \(K_2\) - that is,
there exists \(h\in K_2\) s.t. for all \(f\in\N^{\N}\) we have
\end{enumerate}
\end{definition}
\end{document}
